'use strict';

// Написать функцию, которая изменяет строку под стиль масикровки кредитной карты
// видны должны быть только последние 4 цифры
// если входящая строка меньше 4 цифр, то вовзращать оригинал


Например:  
// funcName('4556364607935616'), '############5616'
// funcName('1'),                '1'
// funcName('11111'),            '#1111'

// function funcName(str) {
//   str.split('').map((el, i) => {
//     return i < (str.length - 4) ? el = '#' : el;
//   }).join('')
// }

function funcName(str) {
  let 
}

// Solutions: 
